/***********************************************************

Copyright 2018 - 2023 speedbot All Rights reserved.

file Name: lib_mpmotion.h

Description:
  Language             ==   motoplus for Yaskawa ROBOT
  Date                 ==   2021 - 09 - 03
  Modification Data    ==   2021 - 09 - 18

Author: speedbot

Version: 1.0
--*********************************************************************************************************--
--                                                                                                         --
--                                                      .^^^                                               --
--                                               .,~<c+{{{{{{t,                                            -- 
--                                       `^,"!t{{{{{{{{{{{{{{{{+,                                          --
--                                 .:"c+{{{{{{{{{{{{{{{{{{{{{{{{{+,                                        --
--                                "{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{~                                       --
--                               ^{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{!.  `^                                    --
--                               c{{{{{{{{{{{{{c~,^`  `.^:<+{{{!.  `<{{+,                                  --
--                              ^{{{{{{{{{{{!^              `,.  `<{{{{{{+:                                --
--                              t{{{{{{{{{!`                    ~{{{{{{{{{{+,                              --
--                             ,{{{{{{{{{:      ,uDWMMH^        `c{{{{{{{{{{{~                             --
--                             +{{{{{{{{:     ,XMMMMMMw           t{{{{{{{{{{t                             --
--                            ,{{{{{{{{t     :MMMMMMMMM"          ^{{{{{{{{{{~                             --
--                            +{{{{{{{{~     8MMMMMMMMMMWD8##      {{{{{{{{{+                              --
--                           :{{{{{{{{{~     8MMMMMMMMMMMMMMH      {{{{{{{{{~                              --
--                           +{{{{{{{{{c     :MMMMMMMMMMMMMMc     ^{{{{{{{{+                               --
--                          ^{{{{{{{{{{{,     ,%MMMMMMMMMMH"      c{{{{{{{{:                               --
--                          `+{{{{{{{{{{{^      :uDWMMMX0"       !{{{{{{{{+                                --
--                           `c{{{{{{{{{{{"                    ^t{{{{{{{{{,                                --
--                             ^c{{{{{{{{{{{".               ,c{{{{{{{{{{t                                 --
--                               ^c{{{{{{{{{{{+<,^`     .^~c{{{{{{{{{{{{{,                                 --
--                                 ^c{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{t                                  --
--                                   ^c{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{t`                                  --
--                                     ^c{{{{{{{{{{{{{{{{{{{{{{{{{{+c"^                                    --                         
--                                       ^c{{{{{{{{{{{{{{{{{+!":^.                                         --
--                                         ^!{{{{{{{{t!",^`                                                --
--                                                                                                         --
--*********************************************************************************************************--
--
*/


#ifndef __SBT_MPDYN_CORR_H__
#define __SBT_MPDYN_CORR_H__

#include "operating_environment.h"

//  杩欎�? B[100] 瀵勫瓨靣ㄦ槸鎺у埗靈哄櫒浜烘縺娲绘垨鑰呯粨靉熼潤鎬佸疄靃朵慨姝ｇ敤靨勶紝涓嶈兘靝嶆�? B[100] 瀵勫瓨靣ㄧ敤浣滃坾瀹冪敤閫?
#define DYN_ENABLE_BREG_NO                  100

typedef LONG mp_dym_offset_t[MP_GRP_AXES_NUM];


//***********************************************************
// func enable_dynamic_()
//***********************************************************
//     in/out : *ThisDynamicSch	* MP_EXPOS_DATA *   * �???靀��殑缝撴瀯靨嬫暟�?? * 
//     return : 			* STATUS * 		    * 濮嬬粓杩斿洖 0 *
//***********************************************************
//  �??敤闈欝€佸疄靃朵慨姝?
//  杩欎釜绋嬪簭浼氬垵濮嬪寲骞惰?�??慨姝ｆ暟�??弬靝帮紝骞朵笖浼氭妸 B[100] 瀵勫瓨靣�??�??�? 1
//  INFORM 闇€鎵�??�?? WAIT B100 = 0 涓婃墠鑳�??寮忔縺娲诲疄靃朵慨姝?
//***********************************************************	
IMPORT STATUS enable_static_dynamic_(MP_EXPOS_DATA *ThisDynamicSch);

//***********************************************************
// func disable_dynamic_()
//***********************************************************
//     in/out : *ThisDynamicSch	* MP_EXPOS_DATA *   * �???靀��殑缝撴瀯靨嬫暟�?? * 
//     return : 			* STATUS * 		    * 濮嬬粓杩斿洖 0 *
//***********************************************************
//  缝撴潫闈欝€佸疄靃朵慨姝?
//  杩欎釜绋嬪簭浼氬垵濮嬪寲�???靝版嵝静傛暟锛屽苟涓斾細�?? B[100] 瀵勫瓨靣�??�??�? 0
//  INFORM 閫氳�? WAIT B100 = 0 靉′欢靚庣粨靉熶慨�??
//***********************************************************	
IMPORT STATUS disable_static_dynamic_(MP_EXPOS_DATA *ThisDynamicSch);

//***********************************************************
// func set_dynamic_frame_()
//***********************************************************
//     in/out : *ThisDynamicSch	* MP_EXPOS_DATA *   * �???靀��殑缝撴瀯靨嬫暟�?? * 
//         in : OffsFrame	* UCHAR *           * �???靀��潗靝囩郴 * 
//         in : UframeNo	* SHORT *           * 鎸囧畾面ㄦ埛�???靃剝殑缂栧彿 * 
//         in : UtoolNo	    * SHORT *           * 鎸囧畾宸ュ坿�???靃剝殑缂栧彿 * 
//     return : 			* STATUS * 		    * 濮嬬粓杩斿洖 0 *
//***********************************************************
//  璝剧疆闈欝€佸疄靃朵慨姝ｅ潗靝囩�?
//  MP_INC_PULSE_DTYPE 0x80 閫氳繃鑴夊啿靝版嵝杩�??澧為噺靊兼寚�?? 
//  MP_INC_ANGLE_DTYPE 0x81 閫氳繃瑙掑害靝版嵝杩�??澧為噺靊兼寚�??
//  MP_INC_BF_DTYPE 0x90 閫氳繃革哄骇靧愭爣绯�??浜ゆ暟鎹?繘睛�??閲忓€兼寚�??
//  MP_INC_RF_DTYPE 0x91 閫氳繃靈哄櫒浜哄潗靝囩郴姝ｄ氦靝版嵝杩涜?澧為噺靊兼寚�??
//  MP_INC_TF_DTYPE 0x92 閫氳繃宸ュ坿靧愭爣绯�??浜ゆ暟鎹?繘睛�??閲忓€兼寚�??
//  MP_INC_UF_DTYPE 0x93 閫氳繃面ㄦ埛靧愭爣绯�??浜ゆ暟鎹?繘睛�??閲忓€兼寚�??
//  靀��埛靧愭爣缂栧�?(0~15锛氫絾靄?粎面ㄦ埛靧愭爣靃舵湝靝堬�?
//***********************************************************	
IMPORT STATUS set_static_dynamic_frame_(MP_EXPOS_DATA *ThisDynamicSch, UCHAR OffsFrame, SHORT UframeNo, SHORT UtoolNo);

//***********************************************************
// func set_dynamic_axis_()
//***********************************************************
//     in/out : *ThisDynamicSch	* MP_EXPOS_DATA *   * �???靀��殑缝撴瀯靨嬫暟�?? * 
//         in : AxisNo	    * UCHAR *           * 杞存瀯鎴愪俊�?? * 
//     return : 			* STATUS * 		    * 濮嬬粓杩斿洖 0 *
//***********************************************************
//  闇€瑕佽繘睛岄潤鎬佸疄靃朵慨姝ｇ殑杞?
//  濡傛睉靄?熀浜庣洿瑙掑潗靝囦慨姝? 锛岄坅睝辨槸 X Y Z Rx Ry Rz E1
//  濡傛睉靄?熀浜庡坧鑺傚潗靝囦慨姝? 锛岄坅睝辨槸 J1 J2 J3 J4 J5 J6 J7
//  靝规嵝浜岃繘青剝爜鎸囧畾
//***********************************************************	
IMPORT STATUS set_static_dynamic_axis_(MP_EXPOS_DATA *ThisDynamicSch, UCHAR AxisNo);
#endif