;***********************************************************
;
; Copyright 2018 - 2023 speedbot All Rights reserved.
;
; File Name: lib_logs
;
; Description:
;   Language             ==   As for KAWASAKI ROBOT
;   Date                 ==   2021 - 10 - 13
;   Modification Data    ==   2021 - 04 - 26
;
; Author: speedbot
;
; Version: 1.0
;*********************************************************************************************************;
;                                                                                                         ;
;                                                      .^^^                                               ;
;                                               .,~<c+{{{{{{t,                                            ; 
;                                       `^,"!t{{{{{{{{{{{{{{{{+,                                          ;
;                                 .:"c+{{{{{{{{{{{{{{{{{{{{{{{{{+,                                        ;
;                                "{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{~                                       ;
;                               ^{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{!.  `^                                    ;
;                               c{{{{{{{{{{{{{c~,^`  `.^:<+{{{!.  `<{{+,                                  ;
;                              ^{{{{{{{{{{{!^              `,.  `<{{{{{{+:                                ;
;                              t{{{{{{{{{!`                    ~{{{{{{{{{{+,                              ;
;                             ,{{{{{{{{{:      ,uDWMMH^        `c{{{{{{{{{{{~                             ;
;                             +{{{{{{{{:     ,XMMMMMMw           t{{{{{{{{{{t                             ;
;                            ,{{{{{{{{t     :MMMMMMMMM"          ^{{{{{{{{{{~                             ;
;                            +{{{{{{{{~     8MMMMMMMMMMWD8##      {{{{{{{{{+                              ;
;                           :{{{{{{{{{~     8MMMMMMMMMMMMMMH      {{{{{{{{{~                              ;
;                           +{{{{{{{{{c     :MMMMMMMMMMMMMMc     ^{{{{{{{{+                               ;
;                          ^{{{{{{{{{{{,     ,%MMMMMMMMMMH"      c{{{{{{{{:                               ;
;                          `+{{{{{{{{{{{^      :uDWMMMX0"       !{{{{{{{{+                                ;
;                           `c{{{{{{{{{{{"                    ^t{{{{{{{{{,                                ;
;                             ^c{{{{{{{{{{{".               ,c{{{{{{{{{{t                                 ;
;                               ^c{{{{{{{{{{{+<,^`     .^~c{{{{{{{{{{{{{,                                 ;
;                                 ^c{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{t                                  ;
;                                   ^c{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{{t`                                  ;
;                                     ^c{{{{{{{{{{{{{{{{{{{{{{{{{{+c"^                                    ;                         
;                                       ^c{{{{{{{{{{{{{{{{{+!":^.                                         ;
;                                         ^!{{{{{{{{t!",^`                                                ;
;                                                                                                         ;
;*********************************************************************************************************;
;

; 2021 - 10 - 12 ++ lib.log_info_()

; 2021 - 10 - 12 ++ lib.log_err_()

; 2021 - 10 - 12 ++ lib.log_warn_()

; 2021 - 10 - 12 ++ lib.log_force_()

; 2022 - 04 - 26 ++ lib.logs_sys1_()

; 2022 - 04 - 26 ++ lib.logs_sys2_()

; 2022 - 04 - 26 ++ lib.logs_sys3_()

; 2022 - 04 - 26 ++ lib.logs_sys4_()

;***********************************************************
; func lib.log_info_()
;***********************************************************
;	IN : .$Tag		        * STRING *  * 输入字符串 *
;   IN : .$Msg              * STRING *  * 输入字符串 *
;***********************************************************
; 示教器信息打印
;***********************************************************
.program lib.log_info_(.$Tag, .$Msg)

    print .$Tag, " I> ", .$Msg

.end 

;***********************************************************
; func lib.log_err_()
;***********************************************************
;	IN : .$Tag		        * STRING *  * 输入字符串 *
;   IN : .$Msg              * STRING *  * 输入字符串 *
;***********************************************************
; 示教器报警打印
;***********************************************************
.program lib.log_err_(.$Tag, .$Msg)

    print .$Tag, " E> ", .$Msg

.end 

;***********************************************************
; func lib.log_warn_()
;***********************************************************
;	IN : .$Tag		        * STRING *  * 输入字符串 *
;   IN : .$Msg              * STRING *  * 输入字符串 *
;***********************************************************
; 示教器警告信息打印
;***********************************************************
.program lib.log_warn_(.$Tag, .$Msg)

    print .$Tag, " W> ", .$Msg

.end 

;***********************************************************
; func lib.log_force_()
;***********************************************************
; 强制弹出 LOG 面板
;***********************************************************
.program lib.log_force_()

    print 2:/S

.end 

;***********************************************************
; func lib.logs_sys1_()
;***********************************************************
;	IN : .$Tag		        * STRING *  * 输入字符串 *
;***********************************************************
; 记录日志
;***********************************************************
.program lib.logs_sys1_(.$Msg)
    if existchar("$LogsTable[1:299]") == 0 then
        for .I = 0 to 299 
            $LogsTable[.I] = " "
        end
        LogsCount = 149
    end
    if LogsCount >= 299 then
        for .I = 0 to 149
            $LogsTable[.I] = $LogsTable[.I + 150]
        end
        for .I = 150 to 299
            $LogsTable[.I] = " "
        end
        LogsCount = 149
    end
    LogsCount = LogsCount + 1
    $LogsTable[LogsCount] = $date(3) + $space(1) + $time + $space(1) + .$Msg      
.end

;***********************************************************
; func lib.logs_sys2_()
;***********************************************************
;	IN : .$Tag		        * STRING *  * 输入字符串 *
;***********************************************************
; 记录日志
;***********************************************************
.program lib.logs_sys2_(.$Msg)
    if existchar("$LogsTable[1:299]") == 0 then
        for .I = 0 to 299 
            $LogsTable[.I] = " "
        end
        LogsCount = 149
    end
    if LogsCount >= 299 then
        for .I = 0 to 149
            $LogsTable[.I] = $LogsTable[.I + 150]
        end
        for .I = 150 to 299
            $LogsTable[.I] = " "
        end
        LogsCount = 149
    end
    LogsCount = LogsCount + 1
    $LogsTable[LogsCount] = $date(3) + $space(1) + $time + $space(1) + .$Msg      
.end

;***********************************************************
; func lib.logs_sys13_()
;***********************************************************
;	IN : .$Tag		        * STRING *  * 输入字符串 *
;***********************************************************
; 记录日志
;***********************************************************
.program lib.logs_sys3_(.$Msg)
    if existchar("$LogsTable[1:299]") == 0 then
        for .I = 0 to 299 
            $LogsTable[.I] = " "
        end
        LogsCount = 149
    end
    if LogsCount >= 299 then
        for .I = 0 to 149
            $LogsTable[.I] = $LogsTable[.I + 150]
        end
        for .I = 150 to 299
            $LogsTable[.I] = " "
        end
        LogsCount = 149
    end
    LogsCount = LogsCount + 1
    $LogsTable[LogsCount] = $date(3) + $space(1) + $time + $space(1) + .$Msg      
.end

;***********************************************************
; func lib.logs_sys4_()
;***********************************************************
;	IN : .$Tag		        * STRING *  * 输入字符串 *
;***********************************************************
; 记录日志
;***********************************************************
.program lib.logs_sys4_(.$Msg)
    if existchar("$LogsTable[1:299]") == 0 then
        for .I = 0 to 299 
            $LogsTable[.I] = " "
        end
        LogsCount = 149
    end
    if LogsCount >= 299 then
        for .I = 0 to 149
            $LogsTable[.I] = $LogsTable[.I + 150]
        end
        for .I = 150 to 299
            $LogsTable[.I] = " "
        end
        LogsCount = 149
    end
    LogsCount = LogsCount + 1
    $LogsTable[LogsCount] = $date(3) + $space(1) + $time + $space(1) + .$Msg      
.end
